[Attack_Mastery]
Description=Complete one combat challenge without taking damage.
Hint=Complete one combat challenge without taking damage.
Title=Flawless Freeflow Fighter

[Batclaw_to_knock_out_an_enemy]
Description=Use the Batclaw to drag an assailant over a drop and knock them out (any play mode).
Hint=Use the Batclaw to drag an assailant over a drop and knock them out (any play mode).
Title=Chain Reaction

[Catch_a_Batarang]
Description=Catch a Batarang (any play mode)
Hint=Catch a Batarang (any play mode)
Title=Catch!

[Combat_Challenges_All_Bronze]
Description=Achieve 8 medals on combat challenges.
Hint=Achieve 8 medals on combat challenges.
Title=Freeflow Bronze

[Combat_Challenges_All_Gold]
Description=Achieve 24 medals on combat challenges.
Hint=Achieve 24 medals on combat challenges.
Title=Freeflow Gold

[Combat_Challenges_All_Silver]
Description=Achieve 16 medals on combat challenges.
Hint=Achieve 16 medals on combat challenges.
Title=Freeflow Silver

[Complete_combo_of_10]
Description=Complete a combo of 10 moves (any play mode).
Hint=Complete a combo of 10 moves (any play mode).
Title=Freeflow Combo 10

[Complete_combo_of_20]
Description=Complete a combo of 20 moves (any play mode).
Hint=Complete a combo of 20 moves (any play mode).
Title=Freeflow Combo 20

[Complete_combo_of_40]
Description=Complete a combo of 40 moves (any play mode).
Hint=Complete a combo of 40 moves (any play mode).
Title=Freeflow Combo 40

[Complete_combo_of_5]
Description=Complete a combo of 5 moves (any play mode).
Hint=Complete a combo of 5 moves (any play mode).
Title=Freeflow Combo 5

[Decontamination_Rescue]
Description=Rescue the guards and henchman from the Joker toxin in Decontamination.
Hint=Rescue the guards and henchman from the Joker toxin in Decontamination.
Title=Leave No Man Behind

[Defeat_Bane]
Description=Defeat Bane
Hint=Defeat Bane
Title=Baneful Payback

[Defeat_Venom_Henchmen]
Description=Defeat two Titan Henchmen at once
Hint=Defeat two Titan Henchmen at once
Title=Double Trouble

[Defeat_Venom_Ivy]
Description=Defeat the giant Titan Ivy plant
Hint=Defeat the giant Titan Ivy plant
Title=Poisoned Ivy

[Defeat_Venom_Joker_Easy]
Description=Deliver an explosive knock out blow to the Joker (Easy difficulty)
Hint=Complete story mode on Easy difficulty
Title=Big Bang

[Defeat_Venom_Joker_Hard]
Description=Deliver an explosive knock out blow to the Joker (Hard difficulty).
Hint=Complete story mode on Hard difficulty.
Title=Biggest Bang

[Defeat_Venom_Joker_Normal]
Description=Deliver an explosive knock out blow to the Joker (Normal difficulty).
Hint=Complete story mode on Normal difficulty
Title=Bigger Bang

[Discover_every_secret]
Description=Solve every riddle on the island.
Hint=Solve every riddle on the island.
Title=Crack The E Nigma

[Drop_enemy_to_KO_other]
Description=String up one henchman and drop him to surprise a second (any play mode).
Hint=String up one henchman and drop him to surprise a second (any play mode).
Title=Rope-a-dope-a-dope

[Escape_Killer_Crocs_lair]
Description=Venture into Killer Croc's lair and come out alive.
Hint=Venture into Killer Croc's lair and come out alive.
Title=Crocodile Tears

[Escape_Scarecrow_nightmare_1]
Description=Survive the nightmare of the Scarecrow's fear gas.
Hint=Survive the nightmare of the Scarecrow's fear gas.
Title=Daydreamer

[Escape_Scarecrow_nightmare_2]
Description=Face your biggest fears and keep your sanity.
Hint=Face your biggest fears and keep your sanity.
Title=Recurring Nightmare

[Escape_Scarecrow_nightmare_3]
Description=Conquer the effects of the Scarecrow's fear gas.
Hint=Conquer the effects of the Scarecrow's fear gas.
Title=Resist The Fear

[Explosive_Gel_KO_3_enemies]
Description=Use the debris from multiple explosions to KO three henchman (Predator challenge map only).
Hint=Use the debris from multiple explosions to KO three henchman (Predator challenge map only).
Title=Super Crash KO

[Finish_fight_with_bang]
Description=Take out the last guard in the final round with a bullet.
Hint=Take out the last guard in the final round with a bullet.
Title=Finish With A Bang!

[Freakshow_rodeo]
Description=Ride a Titan henchman and knock down 5 thugs (any play mode).
Hint=Ride a beast and unleash their power
Title=Freak Show Rodeo

[Freeflow_perfection]
Description=Perform a perfect combo including all of Batman's combat moves (any play mode).
Hint=Perform a perfect combo including all of Batman's combat moves (any play mode).
Title=Freeflow Perfection

[Gel_structual_weakness_to_knock_out_enemy]
Description=Use the debris from an explosion to KO a henchman (any play mode).
Hint=Use the debris from an explosion to KO a henchman (any play mode).
Title=Crash KO

[Get_into_Administration]
Description=Gain access to Administration after it is locked down by the Joker.
Hint=Gain access to Administration after it is locked down by the Joker.
Title=Breaking And Entering

[Glide_over_100m]
Description=Glide continuously for over 100m.
Hint=Glide continuously for over 100m.
Title=Night Glider

[Hanging_takedown]
Description=Perform an inverted Takedown from a vantage point (any play mode).
Hint=Perform an inverted Takedown from a vantage point (any play mode).
Title=Dope On A Rope

[Kill_3_guards_with_1_bullet]
Description=Take out 3 guards with one bullet.
Hint=Take out 3 guards with one bullet.
Title=Magic Bullet

[Kill_3_guards_with_1_teeth]
Description=Take out 3 guards with remote control teeth.
Hint=Take out 3 guards with remote control teeth.
Title=Chew On This!

[Ledge_grab_takedown]
Description=Perform a ledge grab Takedown (any play mode).
Hint=Perform a ledge grab Takedown (any play mode).
Title=Grab And Drop

[Lock_up_Harley]
Description=Capture and lock up Harley Quinn.
Hint=Capture and lock up Harley Quinn.
Title=Solitary Confinement

[Mano_a_mano]
Description=Defeat Titan henchman without using Batarangs (any play mode).
Hint=Take on a beast in hand to hand combat.
Title=Mano-a-mano

[Party_pooper]
Description=KO all the henchmen celebrating your arrival at the party.
Hint=Time to break up this party
Title=Party Pooper

[Perfect_Knight]
Description=100% Complete.
Hint=100% Complete.
Title=Perfect Knight

[Predator_Challenges_All_Bronze]
Description=Achieve 8 medals on predator challenges.
Hint=Achieve 8 medals on predator challenges.
Title=Predator Bronze

[Predator_Challenges_All_Gold]
Description=Achieve 24 medals on predator challenges.
Hint=Achieve 24 medals on predator challenges.
Title=Predator Gold

[Predator_Challenges_All_Silver]
Description=Achieve 16 medals on predator challenges.
Hint=Achieve 16 medals on predator challenges.
Title=Predator Silver

[Reach_Overworld]
Description=Escape from Intensive Treatment to the island surface.
Hint=Escape from Intensive Treatment to the island surface.
Title=Born Free

[Save_all_the_doctors]
Description=Save all the doctors in medical.
Hint=Save all the doctors in medical.
Title=Just What The Doctors Ordered

[Spirit_of_Amadeus_discovered]
Description=Spirit of Amadeus Arkham revealed.
Hint=Solve Arkham's biggest mystery.
Title=World's Greatest Detective

[Stealth_Mastery]
Description=Complete one predator challenge by using only Silent Takedowns and without being detected.
Hint=Complete one predator challenge by using only Silent Takedowns and without being detected.
Title=Invisible Predator

[Survive_Venom_Henchman]
Description=Survive the onslaught from the deformed Joker henchman.
Hint=Survive the onslaught from the deformed Joker henchman.
Title=Malpractice Needs More Practice

[Take_out_Zsasz_Office]
Description=Save Dr. Young from being killed by Victor Zsasz.
Hint=Save Dr. Young from being killed by Victor Zsasz.
Title=Zsasz Cut Down To Size

[Take_out_Zsasz_Pacification]
Description=Take down Zsasz in the Patient Pacification Chamber.
Hint=Take down Zsasz in the Patient Pacification Chamber.
Title=Shocking Rescue

[Ultra_Batclaw_to_KO_3_enemies]
Description=Ultra Batclaw three henchmen over a drop simultaneously and knock them out (any play mode).
Hint=Ultra Batclaw three henchmen over a drop simultaneously and knock them out (any play mode).
Title=Three Fall

[Unlock_all_Arkham_Island]
Description=Solve 85% of Riddler challenges.
Hint=Riddle Resolver
Title=Riddle Resolver

[Unlock_all_Arkham_Mansion]
Description=Solve 25% of Riddler challenges.
Hint=Solve 25% of Riddler challenges.
Title=Lateral Thinker

[Unlock_all_Botanical_Gardens]
Description=Solve 55% of Riddler challenges.
Hint=Solve 55% of Riddler challenges.
Title=Conundrum Cracker

[Unlock_all_Catacombs]
Description=Solve 70% of Riddler challenges.
Hint=Solve 70% of Riddler challenges.
Title=Mental Athlete

[Unlock_all_Intensive_Treatment]
Description=Solve 5% of Riddler challenges.
Hint=Solve 5% of Riddler challenges.
Title=Arkham Analyst

[Unlock_all_Medical_Facility]
Description=Solve 10% of Riddler challenges.
Hint=Solve 10% of Riddler challenges.
Title=Cryptic Investigator

[Unlock_all_Penitentiary]
Description=Solve 40% of Riddler challenges.
Hint=Solve 40% of Riddler challenges.
Title=Mystery Solver
